dangernoodle-io/breadboard/examples/smoke/sdkconfig.defaults.elecrow-p4-hmi7
# Target configuration
CONFIG_IDF_TARGET="esp32p4"

# ESP32-P4 silicon revision — this board has v1.3 (ECO2), NOT production rev-3.0.1+
# pioarduino's espidf.py would inject these for chip_variant=esp32p4_es but its
# write_sdkconfig_file early-returns on pure espidf framework. Set explicitly.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# Flash configuration
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=n

# Console configuration
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# WiFi host configuration (ESP32-P4 routes WiFi via companion C6 chip)
CONFIG_ESP_HOST_WIFI_ENABLED=y

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000
# Stack overflow detection: PTRVAL canary prints the overflowing task name
# instead of aborting silently. Recommended alongside bb_health stack
# monitor. See CONFIG_BB_TASK_REGISTRY_BASE_POLL_MS in bb_task_registry Kconfig.
# No FREERTOS_WATCHPOINT_END_OF_STACK here: P4 has SOC_ASSIST_DEBUG_SUPPORTED,
# so CONFIG_ESP_SYSTEM_HW_STACK_GUARD is already on by default -- a hardware
# SP-bounds check that's deterministic like the watchpoint but costs no
# per-task stack bytes and consumes no CPU watchpoint register.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y

# Logging configuration
CONFIG_LOG_DEFAULT_LEVEL=3
# Enable bb_log panic coredump capture
CONFIG_BB_DIAG_PANIC_COREDUMP=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_BB_LOG_ROUTES=y
CONFIG_BB_OTA_PULL_AUTOREGISTER=y
# Enable RST-based SSE abort teardown (B1-517): bb_http_req_async_abort's
# SO_LINGER{on,0} setsockopt is inert without this — see bb_http.h.
CONFIG_LWIP_SO_LINGER=y
# Enable uxTaskGetSystemState (used by bb_task_registry's periodic base-scan
# and GET /api/diag/tasks) so per-task stack high-water-mark reporting is
# non-stub in smoke builds. See bb_task_registry Kconfig and
# platform/espidf/bb_task_registry/bb_task_registry_base_scan.c. Smoke-only:
# examples/floor deliberately stays minimal (B1-1296).
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# B1-1275: disable WPA2/WPA3-Enterprise WiFi -- the enterprise (802.1X/EAP)
# connection path is unused (no esp_wifi_sta_enterprise_*/esp_eap_client_*
# call sites); this shrinks compiled-in attack surface, not flash --
# linker --gc-sections was already stripping most of the dead code, so the
# measured delta is negligible either way (esp32 +168B, esp32c3 -722B).
# TLS, the mbedTLS cert bundle, and WPA3-Personal/SAE
# (CONFIG_ESP_WIFI_ENABLE_WPA3_SAE) are untouched.
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n

# B1-1482: CONFIG_BB_DATA_HTTP_MAX_CLIENTS now defaults to 3 (SSE+WS+a
# non-blocking egress consumer), but every smoke board -- this one included
# -- only ever composes 2 genuinely-blocking clients: GET /api/events (SSE)
# and GET /ws/events (WS), both unconditionally registered by
# examples/smoke/main/bb_wire.h's codegen markers regardless of this
# board's own CONFIG_HTTPD_WS_SUPPORT setting. Pin the blocking-client
# budget to that real ceiling (2*20ms=40ms < the 50ms default sweep
# interval) rather than letting it silently track MAX_CLIENTS up to 3
# (3*20=60ms >= 50ms, which trips bb_data_http_espidf.c's compile-time
# guard). Mirrors the identical pin on every other smoke board and on
# examples/floor/sdkconfig.defaults.
CONFIG_BB_DATA_HTTP_MAX_BLOCKING_CLIENTS=2
